#include <stdio.h> // стандартна бібліотека, введення та виведення інформації
#include <Windows.h> // директива, яка містить функції, котрі дозволяють коректно працювати з кирилицею

int main(void) {
	SetConsoleOutputCP(1251); // викликаю функцію, яка змінює кодування консолі(щоб можна було правильно виводити кирилицю)
	printf("Введіть п'ятизначне число: ");
	int number; // змінна, яка зберігатиме ввід числа від користувача
	if (scanf("%d", &number) != 1) {
		puts("Введено НЕ коректне значення!\n"); return 1;
	} // зчитування даних і обробка виключених ситуацій
	printf("d = %d\nd1 = ", number);
	if (number < 0) putchar('-'); // додаємо мінус на вивід, якщо введено число від'ємне
	while (number != 0) {
		(number > 0) ? printf("%d", number % 10) : printf("%d", -1 * number % 10); // виводимо залишок від ділення number на 10
		number /= 10;
	}
	putchar('\n'); // вкінці програми дадаємо перехід на новий рядок
	return 0;
}